howido.org
#+title: How I Do
#+subtitle: Documenting my digital environment
#+setupfile: setup.org

Sometimes people ask how I (digitally) do things.  They can read this.

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Introduction
  :END:

This document provides a view into how I use computers with a focus on software.  It is organized into major software categories with subsections for each important package.

It also serves as notebook of documentation to remind me of some details.  Expect some incomplete sections and to see changes over time.

** Typography
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Typography
   :END:

In this document, the prompts used in examples are as:

#+begin_example
  # command run as root
  $ command run as user
#+end_example

** Hardware
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Hardware
   :END:

Hardware interests me less than software so I do not go into detail other than to give hostnames to four hardware roles:

- ~hometop~ :: personal laptop (thinkpad x1e gen2)
- ~worktop~ :: work laptop (thinkpad x1c gen5)
- ~homestation~ :: personal workstation (custom build)
- ~workstation~ :: work workstation (ASLab Marquis)
- ~homeserver~ :: personal server with ports exposed to the Internet

For the last one, I maintain a dynamic DNS subdomain from the great folks at [[https://freedns.afraid.org/][afraid]].


* Configuration
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Configuration
  :END:

Configuration is stored in a private [[https://gitea.io/][Gitea]] and most clones are managed with [[https://github.com/RichiH/vcsh][vcsh]] and [[https://myrepos.branchable.com/][myrepos]] with [[https://www.passwordstore.org/][pass]] managing its own.

The vcsh git repo manager allows multiple git repos to supply files into ~$HOME~ without any actual ~.git/~ directory there.  It allows for the target filesystem space to be interleaved with files managed in separate git repos.  Seems crazy, works great.

My ~vcsh~ repos include config for: bash, bbdb, emacs, git, mr (myrepos), nixpkgs, sawfish, scripts, ssh, systemd, tmux, weechat.  Some of these are described in other sections but first how ~vcsh~ is handled.

** Initialize
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Configuration-Initialize
   :END:

Each repo needs a one time setup like:

#+begin_example
  # apt install vcsh
  $ vcsh init bbdb
  $ vcsh bbdb add .bbdb
  $ vcsh bbdb commit -m "First commit"
  $ vcsh bbdb remote add origin gogs@homeserver:bv/dot-bbdb.git
  $ vcsh bbdb push -u origin master
#+end_example

** Multiple repositories
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Multiple-repositories
   :END:

There is built-in support for multiple repositories in ~vcsh~, eg:

#+BEGIN_EXAMPLE
  $ vcsh status
  $ vcsh pull
  $ vcsh push
#+END_EXAMPLE 

** Bootstrap new account
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Bootstrap-new-account
   :END:

A new account can clone individual repos:

#+begin_example
  $ vcsh clone gogs@homeserver:bv/dot-bbdb.git bbdb
#+end_example

This gets tedious and it's where ~myrepos~ (~mr~) comes in.

#+BEGIN_EXAMPLE
  $ vcsh clone gogs@haiku:bv/dot-myrepos.git mr
  $ cd .config/mr/config.d/
  $ ln -sf ../available.d/* . 
  $ cd 
  $ mr up
#+END_EXAMPLE

An example ~mr~ config looks like:

#+BEGIN_EXAMPLE
  [$HOME/.config/vcsh/repo.d/emacs.git]
  checkout = vcsh clone gogs@bandyv.us.to:bv/dot-emacs.git emacs
#+END_EXAMPLE

** Ignoring
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Ignoring
   :END:

Any git command run through =vcsh= uses =$HOME= as the Git working dir.

#+BEGIN_EXAMPLE
  $ vcsh bbdb status
  [... long list of untracked files ...]
#+END_EXAMPLE

You can have =vcsh= Git command ignore anything not explicitly committed to a =vcsh= Git repository:

#+BEGIN_EXAMPLE
  $ vcsh write-gitignore bbdb
  $ vcsh bbdb status
  On branch master
  Your branch is up-to-date with 'origin/master'.
  nothing to commit, working directory clean
#+END_EXAMPLE

The =write-gitignore= command will create a file like:

#+BEGIN_EXAMPLE
  $ cat ~/.gitignore.d/bbdb 
  ,*
  !/.bbdb
#+END_EXAMPLE

** Making updates
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Making-updates
   :END:

#+BEGIN_EXAMPLE
  $ emacs .bash/completion/vcsh
  $ vcsh bash add -f .bash/completion/vcsh
  $ vcsh bash commit -a -m "Add vcsh completion for bash."
  $ vcsh bash push
#+END_EXAMPLE

** Applying updates
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Applying-updates
   :END:

From each account:

#+begin_example
  $ mr up
#+end_example

or, more usually

#+begin_example
  $ vcsh pull
#+end_example


