howido.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-09 Tue 13:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I Do</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/darksun.css"/>
<link rel="stylesheet" type="text/css" href="export/styles/darksun/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">How I Do
<br />
<span class="subtitle">Documenting my digital environment</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#2021-02-09-Introduction">Introduction</a>
<ul>
<li><a href="#2021-02-09-Typography">Typography</a></li>
<li><a href="#2021-02-09-Hardware">Hardware</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Configuration">Configuration</a>
<ul>
<li><a href="#2021-02-09-Configuration-Initialize">Initialize</a></li>
<li><a href="#2021-02-09-Multiple-repositories">Multiple repositories</a></li>
<li><a href="#2021-02-09-Bootstrap-new-account">Bootstrap new account</a></li>
<li><a href="#2021-02-09-Ignoring">Ignoring</a></li>
<li><a href="#2021-02-09-Making-updates">Making updates</a></li>
<li><a href="#2021-02-09-Applying-updates">Applying updates</a></li>
<li><a href="#2021-02-09-Checking-for-updates">Checking for updates</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Editor">Editor</a>
<ul>
<li><a href="#2021-02-09-Emacs">Emacs</a>
<ul>
<li><a href="#org91decd6">Emacs packages</a></li>
<li><a href="#orgd0f3775">Modular config</a></li>
<li><a href="#orgb251c92">GNUS/BBDB</a></li>
<li><a href="#orgb83a140">LSP</a></li>
<li><a href="#org4bf9b51">Emacs servers</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#2021-02-09-Terminal">Terminal</a>
<ul>
<li><a href="#2021-02-09-Kitty">Kitty</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Command-shell">Shells</a>
<ul>
<li><a href="#2021-02-09-Fish">Fish</a></li>
<li><a href="#2021-02-09-Bash">Bash</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Desktop">Desktop</a>
<ul>
<li><a href="#2021-02-09-Herbsluftwm">Herbsluftwm</a></li>
<li><a href="#orgd8a56da">Rofi</a></li>
<li><a href="#2021-02-09-Sawfish">Sawfish</a></li>
<li><a href="#org4c2eab7">Desktop environment</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Web">Web</a>
<ul>
<li><a href="#2021-02-09-Firefox">Firefox</a>
<ul>
<li><a href="#orgfa29ca2">Load URL via remote without grabbing attention</a></li>
<li><a href="#org1c0b1ab">Emacs-like keybindings in firefox</a></li>
<li><a href="#org28de096">Using Emacs to edit text</a>
<ul>
<li><a href="#org66574e4"><span class="todo TODO">TODO</span> get nice rendered preview for GitHub and Reddit text entries</a></li>
</ul>
</li>
<li><a href="#orgfdfa56e">Bookmark capture</a></li>
<li><a href="#org4855e62">Kill Sticky</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#2021-02-09-Source">Source</a>
<ul>
<li><a href="#2021-02-09-DIY-opt">DIY opt</a></li>
<li><a href="#2021-02-09-Stow">Stow</a></li>
<li><a href="#2021-02-09-CMake">CMake</a></li>
<li><a href="#2021-02-09-autoconf">autoconf</a></li>
<li><a href="#2021-02-09-Spack">Spack</a></li>
<li><a href="#2021-02-09-Nix">Nix</a></li>
<li><a href="#2021-02-09-Python">Python</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Photo-management">Photos</a>
<ul>
<li><a href="#2021-02-09-Rephile">Rephile</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Sync">Sync</a>
<ul>
<li><a href="#2021-02-09-Syncthing">Syncthing</a></li>
<li><a href="#2021-02-09-Git-annex">Git annex</a></li>
</ul>
</li>
<li><a href="#orge6d2070">Passwords</a>
<ul>
<li><a href="#org3434fa7">Pass</a></li>
</ul>
</li>
<li><a href="#2021-02-09-Time">Time</a>
<ul>
<li><a href="#2021-02-09-arbtt">arbtt</a></li>
<li><a href="#2021-02-09-Meetings">Time zones</a></li>
<li><a href="#org5db678c">Meetings</a></li>
</ul>
</li>
<li><a href="#org7ecaf7d">Todo</a></li>
</ul>
</div>
</div>
<p>
Sometimes people ask how I (digitally) do things.  They can read this.
</p>

<div id="outline-container-orgd73752d" class="outline-2">
<h2 id="2021-02-09-Introduction">Introduction</h2>
<div class="outline-text-2" id="text-2021-02-09-Introduction">
<p>
This document provides a view into how I use computers with a focus on software.  It is organized into major software categories with subsections for each important package.
</p>

<p>
It also serves as notebook of documentation to remind me of some details.  Expect some incomplete sections and to see changes over time.
</p>
</div>

<div id="outline-container-org8964236" class="outline-3">
<h3 id="2021-02-09-Typography">Typography</h3>
<div class="outline-text-3" id="text-2021-02-09-Typography">
<p>
In this document, the prompts used in examples are as:
</p>

<pre class="example">
# command run as root
$ command run as user
</pre>
</div>
</div>

<div id="outline-container-org94cdb29" class="outline-3">
<h3 id="2021-02-09-Hardware">Hardware</h3>
<div class="outline-text-3" id="text-2021-02-09-Hardware">
<p>
Hardware interests me less than software so I do not go into detail other than to give hostnames to four hardware roles:
</p>

<dl class="org-dl">
<dt><code>hometop</code></dt><dd>personal laptop (thinkpad x1e gen2)</dd>
<dt><code>worktop</code></dt><dd>work laptop (thinkpad x1c gen5)</dd>
<dt><code>homestation</code></dt><dd>personal workstation (custom build)</dd>
<dt><code>workstation</code></dt><dd>work workstation (ASLab Marquis)</dd>
<dt><code>homeserver</code></dt><dd>personal server with ports exposed to the Internet</dd>
</dl>

<p>
For the last one, I maintain a dynamic DNS subdomain from the great folks at <a href="https://freedns.afraid.org/">afraid</a>.
</p>
</div>
</div>
</div>


<div id="outline-container-org7465c12" class="outline-2">
<h2 id="2021-02-09-Configuration">Configuration</h2>
<div class="outline-text-2" id="text-2021-02-09-Configuration">
<p>
Configuration is stored in a private <a href="https://gitea.io/">Gitea</a> and most clones are managed with <a href="https://github.com/RichiH/vcsh">vcsh</a> and <a href="https://myrepos.branchable.com/">myrepos</a> with <a href="https://www.passwordstore.org/">pass</a> managing its own.
</p>

<p>
The vcsh git repo manager allows multiple git repos to supply files into <code>$HOME</code> without any actual <code>.git/</code> directory there.  It allows for the target filesystem space to be interleaved with files managed in separate git repos.  Seems crazy, works great.
</p>

<p>
My <code>vcsh</code> repos include config for: bash, bbdb, emacs, git, mr (myrepos), nixpkgs, sawfish, scripts, ssh, systemd, tmux, weechat.  Some of these are described in other sections but first how <code>vcsh</code> is handled.
</p>
</div>

<div id="outline-container-org4fba925" class="outline-3">
<h3 id="2021-02-09-Configuration-Initialize">Initialize</h3>
<div class="outline-text-3" id="text-2021-02-09-Configuration-Initialize">
<p>
Each repo needs a one time setup like:
</p>

<pre class="example">
# apt install vcsh
$ vcsh init bbdb
$ vcsh bbdb add .bbdb
$ vcsh bbdb commit -m "First commit"
$ vcsh bbdb remote add origin gogs@homeserver:bv/dot-bbdb.git
$ vcsh bbdb push -u origin master
</pre>
</div>
</div>

<div id="outline-container-orgf2644bb" class="outline-3">
<h3 id="2021-02-09-Multiple-repositories">Multiple repositories</h3>
<div class="outline-text-3" id="text-2021-02-09-Multiple-repositories">
<p>
There is built-in support for multiple repositories in <code>vcsh</code>, eg:
</p>

<pre class="example">
$ vcsh status
$ vcsh pull
$ vcsh push
</pre>
</div>
</div>

<div id="outline-container-org2eb6814" class="outline-3">
<h3 id="2021-02-09-Bootstrap-new-account">Bootstrap new account</h3>
<div class="outline-text-3" id="text-2021-02-09-Bootstrap-new-account">
<p>
A new account can clone individual repos:
</p>

<pre class="example">
$ vcsh clone gogs@homeserver:bv/dot-bbdb.git bbdb
</pre>

<p>
This gets tedious and it's where <code>myrepos</code> (<code>mr</code>) comes in.
</p>

<pre class="example">
$ vcsh clone gogs@haiku:bv/dot-myrepos.git mr
$ cd .config/mr/config.d/
$ ln -sf ../available.d/* . 
$ cd 
$ mr up
</pre>

<p>
An example <code>mr</code> config looks like:
</p>

<pre class="example">
[$HOME/.config/vcsh/repo.d/emacs.git]
checkout = vcsh clone gogs@bandyv.us.to:bv/dot-emacs.git emacs
</pre>
</div>
</div>

<div id="outline-container-org28ab2a1" class="outline-3">
<h3 id="2021-02-09-Ignoring">Ignoring</h3>
<div class="outline-text-3" id="text-2021-02-09-Ignoring">
<p>
Any git command run through <code>vcsh</code> uses <code>$HOME</code> as the Git working dir.
</p>

<pre class="example">
$ vcsh bbdb status
[... long list of untracked files ...]
</pre>

<p>
You can have <code>vcsh</code> Git command ignore anything not explicitly committed to a <code>vcsh</code> Git repository:
</p>

<pre class="example">
$ vcsh write-gitignore bbdb
$ vcsh bbdb status
On branch master
Your branch is up-to-date with 'origin/master'.
nothing to commit, working directory clean
</pre>

<p>
The <code>write-gitignore</code> command will create a file like:
</p>

<pre class="example">
$ cat ~/.gitignore.d/bbdb 
*
!/.bbdb
</pre>
</div>
</div>

<div id="outline-container-org148b01e" class="outline-3">
<h3 id="2021-02-09-Making-updates">Making updates</h3>
<div class="outline-text-3" id="text-2021-02-09-Making-updates">
<pre class="example">
$ emacs .bash/completion/vcsh
$ vcsh bash add -f .bash/completion/vcsh
$ vcsh bash commit -a -m "Add vcsh completion for bash."
$ vcsh bash push
</pre>
</div>
</div>

<div id="outline-container-org7072a1b" class="outline-3">
<h3 id="2021-02-09-Applying-updates">Applying updates</h3>
<div class="outline-text-3" id="text-2021-02-09-Applying-updates">
<p>
From each account:
</p>

<pre class="example">
$ mr up
</pre>

<p>
or, more usually
</p>

<pre class="example">
$ vcsh pull
</pre>
</div>
</div>
