howido.org
** Checking for updates
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Checking-for-updates
   :END:

I want my prompt to tell me when a local account has modified, is
behind the remote vcsh or ahead of it (made a commit but not push).
To check the remote takes time and also needs SSH credentials.  Here's
how I get this bundle of functionality:

- ~vcsh-extra~ :: a script with command ~hooks~, ~probe~ and ~cron~ which
  calls both.  

- fetch :: the ~fetch~ command simply does a:

#+begin_src shell
vcsh foreach fetch
#+end_src

- probe :: the ~probe~ command will run ~vcsh status --terse~ and parse it
  for state to touch files ~last-{ahead,behind,modified}~ (removing any
  stale ones).

- hooks :: the ~hooks~ command install vcsh hooks which will run the
  ~probe~ command named after an action.  Ie in:
  ~post-{pull,push,commit,enter,run}~ is:

#+begin_src shell
$HOME/scripts/vcsh-extra probe
#+end_src

- cron :: the ~cron~ command bundles calls the three commands in sequence after 

#+begin_src 
eval $(keychain --quiet --noask --eval id_rsa)
#+end_src

In summary, the cron job runs once per hour, fetching but not applying
any changes and doing the ~probe~ to summarize what state that leaves
the local ~vcsh~ repositories.

When doing ~vcsh~ commands the hooks run to repeat the ~probe~ (which is
fast enough).

Finally, the Bash ~PROMPT_COMMAND~ will check for the existence
~last-{ahead,behind,modified}~ files and prepend a little marker to the
prompt.  If all three types of "dirty" occur, the prompt looks like:

#+begin_example
{ABM}bv@hal:~
$ 
#+end_example




* Editor
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Editor
  :END:

** Emacs
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Emacs
   :END:

I use Emacs for Email (GNUS), Contacts (BBDB), software development,
document and presentation production (orgmode and LaTeX), bookmark
management (~org-protocol~ and ~org-capture~) and web form text entry
(~atomic-chrome~).  Emacs 27 is soon to be released but I can't wait
so I build it from source (see [[Source]]).  It now allows
~XDG_CONFIG_HOME~ which I make use of by *conceptually* doing:

#+begin_example
  $ rm -rf .emacs*
  $ mkdir .config/emacs
#+end_example

Typing ~emacs~ then uses ~$XDG_CONFIG_HOME/emacs/init.el~.  There's
lots of fashionable ways to configure ~init.el~.  I don't follow then
except to break up the config into many ~init-*.el~ and ~(require)~
them in a big list.  

*** Emacs packages

I heavily use [[https://github.com/jwiegley/use-package][use-package]] and in two modes.  I
want the ability to blow away any ~emacs.d/elpa/~ area and rebuild it
any time but normally don't want to spend the extra load time to query
for package state.  This is in ~init-package.el~:

#+begin_src elisp
(require 'package)
(setq package-archives
      '(("org"     .       "https://orgmode.org/elpa/")
        ("gnu"     .       "https://elpa.gnu.org/packages/")
        ("melpa"   .       "https://melpa.org/packages/")))
(package-initialize)
;; uncomment this block and restart emacs to get new packages
;;;;;
;; (setq use-package-always-ensure t)
;; (package-refresh-contents)
;; (unless (package-installed-p 'use-package)
;;   (package-install 'use-package))
;;;;;;
(require 'use-package)
(provide 'init-packages)
#+end_src

*** Modular config

I factor my Emacs configuration as par ~modular-config~ with "modules" in =~/.config/emacs/init/*.el= and some top level configs listed like:

#+begin_src elisp
(use-package modular-config
  :custom
  (modular-config-list
   '(
     (full (base gui orgmode dired smex spelling markdown lisp cpp python jsonnet tail))
     (email (base gui orgmode email))
     (empty ())
     (plain (base))
     (main (base gui orgmode))
     ;; Used from EDITOR
     (cmdline (base cli))
     ;; Used from $VISUAL
     (visual (base gui))
     (blog (base gui orgpub dired smex spelling markdown cpp python))
     (prog (base gui orgmode dired smex spelling markdown cpp python))
     ;; for calling from GhostText, except we still do it
     ;; through init-atomic-chrome.el
     (ghost (base gui dired ivy smex spelling markdown))
     ;; for calling from $EDITOR
     (shell (base gui dired ivy smex spelling))
     ))
  (modular-config-default 'full)
  (modular-config-path "~/.config/emacs/init")
  :config
  (modular-config-command-line-args-process))
#+end_src

I then may select a configuration on the command line like:

#+begin_example
  $ emacs --config plain [...]
#+end_example


*** GNUS/BBDB

*** LSP

*** Emacs servers

To support bookmark capture (Firefox + org-protocol + a script) and text entry editing (GhostText + atomic-chrome) I have dedicated Emacs server configuration as well.  These servers are started via ~supervisord~ which itself starts from cron:

#+begin_example
  $ crontab -l|grep supervisord
  @reboot supervisord -c /home/bv/scripts/supervisor.conf
#+end_example

That =~/scripts/~ directory is in ~vcsh~.  The two Emacs servers are
started like:

#+begin_example
[program:emacs-capture]
command=%(ENV_HOME)s/scripts/emacs-start-server capture
directory=%(ENV_HOME)s
autorestart = false

[program:emacs-atomic-chrome]
command=%(ENV_HOME)s/scripts/emacs-start-server atomic-chrome
directory=%(ENV_HOME)s
autorestart = false
#+end_example

This ~emacs-start-server~ script is mostly to remind me how to start Emacs properly.  It boils down to running:

#+begin_example
exec emacs -q --fg-daemon=${name} -l ~/.config/emacs/init-${name}.el
#+end_example

As such the nominal ~init.el~ is not sourced.  Each server is self
contained including its ~custom.el~ and its ~elpa/~ area.

For bookmark capture I configure Firefox to call =~/scripts/emacs-capture= script for any ~org-protocol://~ links.  Effectively it calls:
#+begin_example
emacsclient -n -c -s capture \
   -F "((name . \"emacs-capture\") (height . 20) (width . 80))" \
   "org-protocol://capture://w/<encoded-url>/"
#+end_example

This runs on the "capture" server and since it uses ~emacsclient~ it starts very fast.


* Terminal
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Terminal
  :END:

