howido.html


<div id="outline-container-org0c2f2de" class="outline-3">
<h3 id="2021-02-09-Checking-for-updates">Checking for updates</h3>
<div class="outline-text-3" id="text-2021-02-09-Checking-for-updates">
<p>
I want my prompt to tell me when a local account has modified, is
behind the remote vcsh or ahead of it (made a commit but not push).
To check the remote takes time and also needs SSH credentials.  Here's
how I get this bundle of functionality:
</p>

<dl class="org-dl">
<dt><code>vcsh-extra</code></dt><dd>a script with command <code>hooks</code>, <code>probe</code> and <code>cron</code> which
calls both.</dd>

<dt>fetch</dt><dd>the <code>fetch</code> command simply does a:</dd>
</dl>

<div class="org-src-container">
<pre class="src src-shell">vcsh foreach fetch
</pre>
</div>

<dl class="org-dl">
<dt>probe</dt><dd>the <code>probe</code> command will run <code>vcsh status --terse</code> and parse it
for state to touch files <code>last-{ahead,behind,modified}</code> (removing any
stale ones).</dd>

<dt>hooks</dt><dd>the <code>hooks</code> command install vcsh hooks which will run the
<code>probe</code> command named after an action.  Ie in:
<code>post-{pull,push,commit,enter,run}</code> is:</dd>
</dl>

<div class="org-src-container">
<pre class="src src-shell">$<span style="color: #fcaf3e;">HOME</span>/scripts/vcsh-extra probe
</pre>
</div>

<dl class="org-dl">
<dt>cron</dt><dd>the <code>cron</code> command bundles calls the three commands in sequence after</dd>
</dl>

<pre class="example">
eval $(keychain --quiet --noask --eval id_rsa)
</pre>

<p>
In summary, the cron job runs once per hour, fetching but not applying
any changes and doing the <code>probe</code> to summarize what state that leaves
the local <code>vcsh</code> repositories.
</p>

<p>
When doing <code>vcsh</code> commands the hooks run to repeat the <code>probe</code> (which is
fast enough).
</p>

<p>
Finally, the Bash <code>PROMPT_COMMAND</code> will check for the existence
<code>last-{ahead,behind,modified}</code> files and prepend a little marker to the
prompt.  If all three types of "dirty" occur, the prompt looks like:
</p>

<pre class="example">
{ABM}bv@hal:~
$ 
</pre>
</div>
</div>
</div>




<div id="outline-container-org155d4ab" class="outline-2">
<h2 id="2021-02-09-Editor">Editor</h2>
<div class="outline-text-2" id="text-2021-02-09-Editor">
</div>

<div id="outline-container-orgbeeb1d1" class="outline-3">
<h3 id="2021-02-09-Emacs">Emacs</h3>
<div class="outline-text-3" id="text-2021-02-09-Emacs">
<p>
I use Emacs for Email (GNUS), Contacts (BBDB), software development,
document and presentation production (orgmode and LaTeX), bookmark
management (<code>org-protocol</code> and <code>org-capture</code>) and web form text entry
(<code>atomic-chrome</code>).  Emacs 27 is soon to be released but I can't wait
so I build it from source (see <a href="#2021-02-09-Source">Source</a>).  It now allows
<code>XDG_CONFIG_HOME</code> which I make use of by <b>conceptually</b> doing:
</p>

<pre class="example">
$ rm -rf .emacs*
$ mkdir .config/emacs
</pre>

<p>
Typing <code>emacs</code> then uses <code>$XDG_CONFIG_HOME/emacs/init.el</code>.  There's
lots of fashionable ways to configure <code>init.el</code>.  I don't follow then
except to break up the config into many <code>init-*.el</code> and <code>(require)</code>
them in a big list.  
</p>
</div>

<div id="outline-container-org91decd6" class="outline-4">
<h4 id="org91decd6">Emacs packages</h4>
<div class="outline-text-4" id="text-org91decd6">
<p>
I heavily use <a href="https://github.com/jwiegley/use-package">use-package</a> and in two modes.  I
want the ability to blow away any <code>emacs.d/elpa/</code> area and rebuild it
any time but normally don't want to spend the extra load time to query
for package state.  This is in <code>init-package.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">package</span>)
(<span style="color: #b4fa70;">setq</span> package-archives
      '((<span style="color: #e9b96e;">"org"</span>     .       <span style="color: #e9b96e;">"https://orgmode.org/elpa/"</span>)
        (<span style="color: #e9b96e;">"gnu"</span>     .       <span style="color: #e9b96e;">"https://elpa.gnu.org/packages/"</span>)
        (<span style="color: #e9b96e;">"melpa"</span>   .       <span style="color: #e9b96e;">"https://melpa.org/packages/"</span>)))
(package-initialize)
<span style="color: #73d216;">;; </span><span style="color: #73d216;">uncomment this block and restart emacs to get new packages</span>
<span style="color: #73d216;">;;;;;</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">(setq use-package-always-ensure t)</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">(package-refresh-contents)</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">(unless (package-installed-p 'use-package)</span>
<span style="color: #73d216;">;;   </span><span style="color: #73d216;">(package-install 'use-package))</span>
<span style="color: #73d216;">;;;;;;</span>
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">use-package</span>)
(<span style="color: #b4fa70;">provide</span> '<span style="color: #e9b2e3;">init-packages</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0f3775" class="outline-4">
<h4 id="orgd0f3775">Modular config</h4>
<div class="outline-text-4" id="text-orgd0f3775">
<p>
I factor my Emacs configuration as par <code>modular-config</code> with "modules" in <code>~/.config/emacs/init/*.el</code> and some top level configs listed like:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">modular-config</span>
  <span style="color: #e090d7;">:custom</span>
  (modular-config-list
   '(
     (full (base gui orgmode dired smex spelling markdown lisp cpp python jsonnet tail))
     (email (base gui orgmode email))
     (empty ())
     (plain (base))
     (main (base gui orgmode))
     <span style="color: #73d216;">;; </span><span style="color: #73d216;">Used from EDITOR</span>
     (cmdline (base cli))
     <span style="color: #73d216;">;; </span><span style="color: #73d216;">Used from $VISUAL</span>
     (visual (base gui))
     (blog (base gui orgpub dired smex spelling markdown cpp python))
     (prog (base gui orgmode dired smex spelling markdown cpp python))
     <span style="color: #73d216;">;; </span><span style="color: #73d216;">for calling from GhostText, except we still do it</span>
     <span style="color: #73d216;">;; </span><span style="color: #73d216;">through init-atomic-chrome.el</span>
     (ghost (base gui dired ivy smex spelling markdown))
     <span style="color: #73d216;">;; </span><span style="color: #73d216;">for calling from $EDITOR</span>
     (shell (base gui dired ivy smex spelling))
     ))
  (modular-config-default 'full)
  (modular-config-path <span style="color: #e9b96e;">"~/.config/emacs/init"</span>)
  <span style="color: #e090d7;">:config</span>
  (modular-config-command-line-args-process))
</pre>
</div>

<p>
I then may select a configuration on the command line like:
</p>

<pre class="example">
$ emacs --config plain [...]
</pre>
</div>
</div>


<div id="outline-container-orgb251c92" class="outline-4">
<h4 id="orgb251c92">GNUS/BBDB</h4>
</div>

<div id="outline-container-orgb83a140" class="outline-4">
<h4 id="orgb83a140">LSP</h4>
</div>

<div id="outline-container-org4bf9b51" class="outline-4">
<h4 id="org4bf9b51">Emacs servers</h4>
<div class="outline-text-4" id="text-org4bf9b51">
<p>
To support bookmark capture (Firefox + org-protocol + a script) and text entry editing (GhostText + atomic-chrome) I have dedicated Emacs server configuration as well.  These servers are started via <code>supervisord</code> which itself starts from cron:
</p>

<pre class="example">
$ crontab -l|grep supervisord
@reboot supervisord -c /home/bv/scripts/supervisor.conf
</pre>

<p>
That =~/scripts/~ directory is in <code>vcsh</code>.  The two Emacs servers are
started like:
</p>

<pre class="example">
[program:emacs-capture]
command=%(ENV_HOME)s/scripts/emacs-start-server capture
directory=%(ENV_HOME)s
autorestart = false

[program:emacs-atomic-chrome]
command=%(ENV_HOME)s/scripts/emacs-start-server atomic-chrome
directory=%(ENV_HOME)s
autorestart = false
</pre>

<p>
This <code>emacs-start-server</code> script is mostly to remind me how to start Emacs properly.  It boils down to running:
</p>

<pre class="example">
exec emacs -q --fg-daemon=${name} -l ~/.config/emacs/init-${name}.el
</pre>

<p>
As such the nominal <code>init.el</code> is not sourced.  Each server is self
contained including its <code>custom.el</code> and its <code>elpa/</code> area.
</p>

<p>
For bookmark capture I configure Firefox to call <code>~/scripts/emacs-capture</code> script for any <code>org-protocol://</code> links.  Effectively it calls:
</p>
<pre class="example">
emacsclient -n -c -s capture \
   -F "((name . \"emacs-capture\") (height . 20) (width . 80))" \
   "org-protocol://capture://w/&lt;encoded-url&gt;/"
</pre>

<p>
This runs on the "capture" server and since it uses <code>emacsclient</code> it starts very fast.
</p>
</div>
</div>
</div>
</div>
