howido.org
** Kitty
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Kitty
   :END:

I've tried many terminals over the years and for about the last year I have been very happily using the [[https://sw.kovidgoyal.net/kitty/][Kitty]] terminal.  I mean the one written in Python/OpenGL and not the on derived from Putty.  Some reasons why I like it:

- emoji support!
- ~C-S-h~ to load scrollback into ~less~
- fast, beautiful text, Free Software 

It also has sub-programs called "kittens" such as ~kitten icat
foo.png~ to show a graphic in the terminal.  Or ~kitten diff~ to show
a pretty side-by-side diff.  These are nice but I rarely use them.

Here is install:

#+begin_example
python3 setup.py --prefix=/usr/local/stow/kitty-0.19.3 linux-package                                               

#+end_example

See [[https://sw.kovidgoyal.net/kitty/build.html][kitty build instructions]] and [[Stow]] for more info.


No longer but in the past, I built and ran Kitty directly from source:

#+begin_example
  $ cd dev/kitty
  $ git pull
  $ git checkout vX.Y.Z
  $ make
#+end_example

Then, run the result directly from the source:

#+begin_example
  $ cat bin/kitty 
  #!/usr/bin/env python3
  import runpy
  runpy.run_path('/home/bv/dev/kitty', run_name='__main__')
#+end_example

No particularly fancy config (lives in ~.config/kitty/kitty.conf~).


* Shells
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Command-shell
  :END:

I have moved my main account on ~hometop~ and ~homestation~ to the Fish shell but have long and still use Bash on other accounts.  In Fish accounts I will sometimes still start Bash to do some complex command which I've yet to master in Fish.  In this mixed environment it is sometimes necessary to explicitly set ~SHELL~ to either ~fish~ or ~bash~.

** Fish
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Fish
   :END:

Fish is a really amazing shell which requires very little configuration to make it "feel right".  Here are a few things I do with fish.

I use the [[https://github.com/IlanCosman/tide][tide]] prompt which is very nice, easy and popular.  Amazingly, it is as I like it out of the box and I do very little customization.  

I use this ~fzf~ / Fish integration:

#+begin_example
  $ fisher add PatricF1/fzf.fish
#+end_example

Only customization is to override the ~C-f~ keybinding as it's needed for my Emacs-trained fingers for character-forward.  In ~config.fish~

#+begin_src fish
  # override fzf bindings
  bind --erase \cf
  bind \co '__fzf_search_current_dir'
#+end_src

To use ~direnv~ I add per docs, ~conf.d/direnv.fish~ with

#+begin_src fish
  eval (direnv hook fish)
#+end_src

When I started learning Fish, I ported my shell implemenation [[https://github.com/brettviren/shist][shist]] of [[https://github.com/barabo/advanced-shell-history][ash]] to  [[https://github.com/brettviren/fishql][fishql]].  This gave a nice vehicle to dive into Fish programming.  However, I've stopped using it due to some quoting problem and because I find I almost never actually use the SQL query functionality.

** Bash
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Bash
   :END:

Though I am moving to Fish, I keep my Bash setup alive as I sometimes will start Bash in my Fish accounts and still have some accounts not yet moved to Fish. 

My ~.bashrc~ is run for login or subshells.  It delegates
configuration to scripts under
~/.bash/{functions,variables,apps}/*.sh~ and "mounts" some git subtrees under ~/.bash/subtrees~.  

One subtree of note is [[https://github.com/brettviren/shist][shist]] which is my Bash implementation of [[https://github.com/barabo/advanced-shell-history][advanced shell history]].  This integrates with Bash prompting to record history in an Sqlite3 database.

I strongly avoid using ~alias~ (eg, no ~ll~ for ~ls -l~) as I think inventing my own Unix command set is an anti-pattern.  I do capture some larger commands in Bash functions so that tab-completion can remind me of the (eg, a bunch of ~emacs-server-*~ functions to manage different Emacs servers).

I used to loop over ~$HOME/opt/*/{bin,lib,man,lib/pkgconfig}~ to set ~PATH, LD_LIBRARY_PATH, MANPATH, PKG_CONFIG_PATH~.  This I now deprecate in favor of a Stow-based install for common software and a per-development area governed by ~direnv~.
See [[Source]] for more info on this aspect.



* Desktop
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Desktop
  :END:

By which I mean what the X11 (and not wayland) server manages.

I'm in the process of migrating from Sawfish to Herbsluftwm.  I've used Sawfish since it was the official Gnome WM back in the 90's (back before Gnome put sugar before protein).  Sawfish is really a terrific stacking/floating WM but I wanted to move to a tiling paradigm.  Sawfish has some rudimentary support for tiling and I initially toyed with adding more but figured I should first try some "real" tiling WMs.  Along came Herbsluftwm which I chose over the others because it had nice graph diagrams right in the man page.  I've since looked at others (awesome, i3, dwm) and they are nice but I got lucky on the first draw and have fallen deeply for it.  So, I bid Sawfish a fond farewell and wish the community all the best (there are tens of us!).

** Herbsluftwm
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Herbsluftwm
   :END:

Herbsluftwm [German for autumn wind(ow manager)] is configured by issuing commands from the client application ~herbstclient~ (~hc~).  These commands are typically captured in two files:

- ~autostart~ :: main configuration holding keybindings, theme settings and starting any "panels"
- ~panel.sh~ :: a long running process transforming WM events (via ~hc --idel~) and others into input piped to a "bar" program (~dzen2~ is common)

Both of these are typically found at =~/.config/herbstluftwm/=.

A lot of great shell hackery exists in this space including the default event-driven ~panel.sh~ which taught me a thing or three.   But, I wanted to rely on something more "formal" so created [[https://brettviren.github.io/herbie][herbie]].  It contains Python reimplementations of a lot of Herbsluftwm community shell hackery as well as a few new things.  It's documentation describes how to configure and integrate into ~autostart~.


** Rofi

My ~herbie~ speaks through ~rofi~  in many cases and ~rofi~ is used directly for some.

- ~rofi-screenshot~ custom script to take screen shots and optionally upload them to a popular image host with help of ~maim~ and ~rephile~.  See [[Photos]].
- [[https://github.com/carnager/rofi-pass][~rofi-pass~]] for accessing my password store (see [[Passwords]])

