howido.html


<div id="outline-container-org384ec65" class="outline-2">
<h2 id="2021-02-09-Terminal">Terminal</h2>
<div class="outline-text-2" id="text-2021-02-09-Terminal">
</div>

<div id="outline-container-orgff1721d" class="outline-3">
<h3 id="2021-02-09-Kitty">Kitty</h3>
<div class="outline-text-3" id="text-2021-02-09-Kitty">
<p>
I've tried many terminals over the years and for about the last year I have been very happily using the <a href="https://sw.kovidgoyal.net/kitty/">Kitty</a> terminal.  I mean the one written in Python/OpenGL and not the on derived from Putty.  Some reasons why I like it:
</p>

<ul class="org-ul">
<li>emoji support!</li>
<li><code>C-S-h</code> to load scrollback into <code>less</code></li>
<li>fast, beautiful text, Free Software</li>
</ul>

<p>
It also has sub-programs called "kittens" such as <code>kitten icat
foo.png</code> to show a graphic in the terminal.  Or <code>kitten diff</code> to show
a pretty side-by-side diff.  These are nice but I rarely use them.
</p>

<p>
Here is install:
</p>

<pre class="example">
python3 setup.py --prefix=/usr/local/stow/kitty-0.19.3 linux-package                                               

</pre>

<p>
See <a href="https://sw.kovidgoyal.net/kitty/build.html">kitty build instructions</a> and <a href="#2021-02-09-Stow">Stow</a> for more info.
</p>


<p>
No longer but in the past, I built and ran Kitty directly from source:
</p>

<pre class="example">
$ cd dev/kitty
$ git pull
$ git checkout vX.Y.Z
$ make
</pre>

<p>
Then, run the result directly from the source:
</p>

<pre class="example">
$ cat bin/kitty 
#!/usr/bin/env python3
import runpy
runpy.run_path('/home/bv/dev/kitty', run_name='__main__')
</pre>

<p>
No particularly fancy config (lives in <code>.config/kitty/kitty.conf</code>).
</p>
</div>
</div>
</div>


<div id="outline-container-org31336f4" class="outline-2">
<h2 id="2021-02-09-Command-shell">Shells</h2>
<div class="outline-text-2" id="text-2021-02-09-Command-shell">
<p>
I have moved my main account on <code>hometop</code> and <code>homestation</code> to the Fish shell but have long and still use Bash on other accounts.  In Fish accounts I will sometimes still start Bash to do some complex command which I've yet to master in Fish.  In this mixed environment it is sometimes necessary to explicitly set <code>SHELL</code> to either <code>fish</code> or <code>bash</code>.
</p>
</div>

<div id="outline-container-org8745efa" class="outline-3">
<h3 id="2021-02-09-Fish">Fish</h3>
<div class="outline-text-3" id="text-2021-02-09-Fish">
<p>
Fish is a really amazing shell which requires very little configuration to make it "feel right".  Here are a few things I do with fish.
</p>

<p>
I use the <a href="https://github.com/IlanCosman/tide">tide</a> prompt which is very nice, easy and popular.  Amazingly, it is as I like it out of the box and I do very little customization.  
</p>

<p>
I use this <code>fzf</code> / Fish integration:
</p>

<pre class="example">
$ fisher add PatricF1/fzf.fish
</pre>

<p>
Only customization is to override the <code>C-f</code> keybinding as it's needed for my Emacs-trained fingers for character-forward.  In <code>config.fish</code>
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #73d216;"># </span><span style="color: #73d216;">override fzf bindings</span>
<span style="color: #e090d7;">bind</span> --erase \cf
<span style="color: #e090d7;">bind</span> \co <span style="color: #e9b96e;">'__fzf_search_current_dir'</span>
</pre>
</div>

<p>
To use <code>direnv</code> I add per docs, <code>conf.d/direnv.fish</code> with
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #b4fa70;">eval</span> (<span style="color: #e090d7;">direnv</span> hook <span style="color: #e090d7;">fish</span>)
</pre>
</div>

<p>
When I started learning Fish, I ported my shell implemenation <a href="https://github.com/brettviren/shist">shist</a> of <a href="https://github.com/barabo/advanced-shell-history">ash</a> to  <a href="https://github.com/brettviren/fishql">fishql</a>.  This gave a nice vehicle to dive into Fish programming.  However, I've stopped using it due to some quoting problem and because I find I almost never actually use the SQL query functionality.
</p>
</div>
</div>

<div id="outline-container-orgd29af0d" class="outline-3">
<h3 id="2021-02-09-Bash">Bash</h3>
<div class="outline-text-3" id="text-2021-02-09-Bash">
<p>
Though I am moving to Fish, I keep my Bash setup alive as I sometimes will start Bash in my Fish accounts and still have some accounts not yet moved to Fish. 
</p>

<p>
My <code>.bashrc</code> is run for login or subshells.  It delegates
configuration to scripts under
<code>/.bash/{functions,variables,apps}/*.sh</code> and "mounts" some git subtrees under <code>/.bash/subtrees</code>.  
</p>

<p>
One subtree of note is <a href="https://github.com/brettviren/shist">shist</a> which is my Bash implementation of <a href="https://github.com/barabo/advanced-shell-history">advanced shell history</a>.  This integrates with Bash prompting to record history in an Sqlite3 database.
</p>

<p>
I strongly avoid using <code>alias</code> (eg, no <code>ll</code> for <code>ls -l</code>) as I think inventing my own Unix command set is an anti-pattern.  I do capture some larger commands in Bash functions so that tab-completion can remind me of the (eg, a bunch of <code>emacs-server-*</code> functions to manage different Emacs servers).
</p>

<p>
I used to loop over <code>$HOME/opt/*/{bin,lib,man,lib/pkgconfig}</code> to set <code>PATH, LD_LIBRARY_PATH, MANPATH, PKG_CONFIG_PATH</code>.  This I now deprecate in favor of a Stow-based install for common software and a per-development area governed by <code>direnv</code>.
See <a href="#2021-02-09-Source">Source</a> for more info on this aspect.
</p>
</div>
</div>
</div>



<div id="outline-container-org83ee3e2" class="outline-2">
<h2 id="2021-02-09-Desktop">Desktop</h2>
<div class="outline-text-2" id="text-2021-02-09-Desktop">
<p>
By which I mean what the X11 (and not wayland) server manages.
</p>

<p>
I'm in the process of migrating from Sawfish to Herbsluftwm.  I've used Sawfish since it was the official Gnome WM back in the 90's (back before Gnome put sugar before protein).  Sawfish is really a terrific stacking/floating WM but I wanted to move to a tiling paradigm.  Sawfish has some rudimentary support for tiling and I initially toyed with adding more but figured I should first try some "real" tiling WMs.  Along came Herbsluftwm which I chose over the others because it had nice graph diagrams right in the man page.  I've since looked at others (awesome, i3, dwm) and they are nice but I got lucky on the first draw and have fallen deeply for it.  So, I bid Sawfish a fond farewell and wish the community all the best (there are tens of us!).
</p>
</div>

<div id="outline-container-org61e6115" class="outline-3">
<h3 id="2021-02-09-Herbsluftwm">Herbsluftwm</h3>
<div class="outline-text-3" id="text-2021-02-09-Herbsluftwm">
<p>
Herbsluftwm [German for autumn wind(ow manager)] is configured by issuing commands from the client application <code>herbstclient</code> (<code>hc</code>).  These commands are typically captured in two files:
</p>

<dl class="org-dl">
<dt><code>autostart</code></dt><dd>main configuration holding keybindings, theme settings and starting any "panels"</dd>
<dt><code>panel.sh</code></dt><dd>a long running process transforming WM events (via <code>hc --idel</code>) and others into input piped to a "bar" program (<code>dzen2</code> is common)</dd>
</dl>

<p>
Both of these are typically found at <code>~/.config/herbstluftwm/</code>.
</p>

<p>
A lot of great shell hackery exists in this space including the default event-driven <code>panel.sh</code> which taught me a thing or three.   But, I wanted to rely on something more "formal" so created <a href="https://brettviren.github.io/herbie">herbie</a>.  It contains Python reimplementations of a lot of Herbsluftwm community shell hackery as well as a few new things.  It's documentation describes how to configure and integrate into <code>autostart</code>.
</p>
</div>
</div>


<div id="outline-container-orgd8a56da" class="outline-3">
<h3 id="orgd8a56da">Rofi</h3>
<div class="outline-text-3" id="text-orgd8a56da">
<p>
My <code>herbie</code> speaks through <code>rofi</code>  in many cases and <code>rofi</code> is used directly for some.
</p>

<ul class="org-ul">
<li><code>rofi-screenshot</code> custom script to take screen shots and optionally upload them to a popular image host with help of <code>maim</code> and <code>rephile</code>.  See <a href="#2021-02-09-Photo-management">Photos</a>.</li>
<li><a href="https://github.com/carnager/rofi-pass"><code>rofi-pass</code></a> for accessing my password store (see <a href="#orge6d2070">Passwords</a>)</li>
</ul>
</div>
</div>
