howido.org
** Sawfish
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Sawfish
   :END:

The Sawfish X11 window manager was at one time the official WM for
Gnome.  That is the time when I first started using it, moving from
TWM and then FVWM.  I've tried a few since but always come back.
Sawfish is configured and largely written in its own flavor of lisp
([[https://sawfish.fandom.com/wiki/Librep][rep]]) and so can reasonably be considered the Emacs of window
managers.  For configuration, it does an even better job than Emacs of
providing both a programmable and a GUI configuration method and the
two work largely well together.  Some of the reasons I use Sawfish:

- hugely configurable but sane defaults
- my fingers have learned the key bindings I chose years (decades!) ago
- I bake the configuration into a git repo
- I can run an arbitrary program from a command line without opening a terminal
- tab-like navigation between virtual desktops
- window "filling" which I find a better compromise between stacking and tiling idioms 
- window dressing with themes and per matched windows (eg, Firefox has no borders)


** Desktop environment

I largely have moved away from using a full DE.  I have MATE (Gnome 2) in with Sawfish on some computers but been replacing MATE panel and menus with dzen2 and rofi.

* Web
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Web
  :END:


** Firefox
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Firefox
   :END:

Firefox is the least worse web browser despite how Mozilla tries so
hard to kill off its user base.  Not much to say except how I battle
some of its worse behavior:

*** Load URL via remote without grabbing attention

Set ~browser.tabs.loadDivertedInBackground~ to ~true~ in
~about:config~.  Otherwise sending a URL via remote open will have
Firefox grab focus, possibly switching to it on a different virtual
desktop.  This is super annoying when doing important things like
loading the morning's web comics from ~liferea~.

*** Emacs-like keybindings in firefox 

This is one of the most frustrating things and most of the things
found online are wrong.  What to do depends on the desktop environment
*and* its version *and* maybe the distribution.

Debian ~buster~ and MATE 1.20.

#+BEGIN_EXAMPLE
gsettings set org.mate.interface gtk-key-theme 'Emacs'
#+END_EXAMPLE

Or, 


#+begin_example
  ~/.config/gtk-3.0/settings.ini:

  # Get firefox to use emacs keybindings
  [Settings]
  gtk-key-theme-name = Emacs
#+end_example

For [[https://developer.mozilla.org/en-US/docs/Tools/Settings#Editor_Preferences][editor]] ~about:config~ and

#+begin_center
devtools.editor.keymap emacs
#+end_center


*** Using Emacs to edit text

There used to be [[../itsalltext/index.org][ItsAllText]].  Now there is [[https://addons.mozilla.org/en-US/firefox/addon/edit-with-emacs1/][Edit with Emacs]] and
[[https://addons.mozilla.org/en-US/firefox/addon/ghosttext/][GhostText]].  The former I could not make work and the latter seems
fine.

GhostText needs ~atomic-chrome~ to be running on Emacs.  It's
available from the Emacs package sites.  In [[Emacs servers]] I describe
how the Emacs server for atomic-chrome to talk to get started.  The
main Emacs parts in ~init-atomic-chrome.el~ are:

#+begin_src elisp
  (setq server-name "atomic-chrome")
  (use-package markdown-mode
    :ensure t
    :config
    (setq markdown-command "/usr/bin/markdown"))
  (use-package markdown-preview-mode
    :ensure t)
  (use-package atomic-chrome
    :ensure t
    :config
    (setq atomic-chrome-default-major-mode 'markdown-mode)
    (setq atomic-chrome-url-major-mode-alist
          '(("github\\.com" . gfm-mode)
            ("reddit\\.com" . markdown-mode)
            ("redmine" . textile-mode)))
    (setq atomic-chrome-buffer-open-style 'frame)
  )
  (atomic-chrome-start-server)
#+end_src

To use, I click the GhostText icon, sometimes it prompts me for which
text area to edit, then an Emacs frame pops us.  As I type in Emacs
the text entry updates.

**** TODO get nice rendered preview for GitHub and Reddit text entries

*** Bookmark capture

The ~emacs-capture~ and Emacs server "capture" is described above.  On the Firefox end I need a bookmarklet:

#+begin_example
javascript:location.href='org-protocol://capture://w/'+encodeURIComponent(location.href)+'/'+encodeURIComponent(document.title)+'/'+encodeURIComponent(window.getSelection())
#+end_example

The ~/w/~ corresponds to an org capture template

#+begin_src elisp
  (setq org-capture-templates
        (quote
         (("w" "Web Bookmark" entry
           (file+headline "~/org/webcapture.org" "Bookmarks")
           "* %a :website:%^G\n:PROPERTIES:\n:CREATED: %U\n:END:\n%i\n %?"
           :empty-lines 1 :immediate-finish nil)))
        org-agenda-files (list "~/org/webcapture.org"))
#+end_src

Some frame management is done with:

#+begin_src elisp
  (defadvice org-capture
      (after make-full-window-frame activate)
    "Advise capture to be the only window when used as a popup"
   (if (equal "emacs-capture" (frame-parameter nil 'name))
       (delete-other-windows)))

  (defadvice org-capture-finalize
      (after delete-capture-frame activate)
    "Advise capture-finalize to close the frame"
    (if (equal "emacs-capture" (frame-parameter nil 'name))
        (delete-frame)))
#+end_src

*** Kill Sticky

The web is mostly festering garbage and getting worse over time.  Many web sites, even ones that should know batter (stack overflow) put up so much obscuring crap that it can be hard to see the content.  Enter *Kill Sticky* (not a Tarantino movie, but better).  It is [[https://alisdair.mcdiarmid.org/kill-sticky-headers/][this bookmarklet]]:

#+begin_example
javascript:(function()%7B(function%20()%20%7Bvar%20i%2C%20elements%20%3D%20document.querySelectorAll('body%20*')%3Bfor%20(i%20%3D%200%3B%20i%20%3C%20elements.length%3B%20i%2B%2B)%20%7Bif%20(getComputedStyle(elements%5Bi%5D).position%20%3D%3D%3D%20'fixed')%20%7Belements%5Bi%5D.parentNode.removeChild(elements%5Bi%5D)%3B%7D%7D%7D)()%7D)()
#+end_example


* Source
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Source
  :END:

See also [[Configuration]] and individual package sections.  Here I describe ways I install software locally which means outside of Debian's package management.

