howido.html

<div id="outline-container-orgaaa5bdc" class="outline-3">
<h3 id="2021-02-09-Sawfish">Sawfish</h3>
<div class="outline-text-3" id="text-2021-02-09-Sawfish">
<p>
The Sawfish X11 window manager was at one time the official WM for
Gnome.  That is the time when I first started using it, moving from
TWM and then FVWM.  I've tried a few since but always come back.
Sawfish is configured and largely written in its own flavor of lisp
(<a href="https://sawfish.fandom.com/wiki/Librep">rep</a>) and so can reasonably be considered the Emacs of window
managers.  For configuration, it does an even better job than Emacs of
providing both a programmable and a GUI configuration method and the
two work largely well together.  Some of the reasons I use Sawfish:
</p>

<ul class="org-ul">
<li>hugely configurable but sane defaults</li>
<li>my fingers have learned the key bindings I chose years (decades!) ago</li>
<li>I bake the configuration into a git repo</li>
<li>I can run an arbitrary program from a command line without opening a terminal</li>
<li>tab-like navigation between virtual desktops</li>
<li>window "filling" which I find a better compromise between stacking and tiling idioms</li>
<li>window dressing with themes and per matched windows (eg, Firefox has no borders)</li>
</ul>
</div>
</div>


<div id="outline-container-org4c2eab7" class="outline-3">
<h3 id="org4c2eab7">Desktop environment</h3>
<div class="outline-text-3" id="text-org4c2eab7">
<p>
I largely have moved away from using a full DE.  I have MATE (Gnome 2) in with Sawfish on some computers but been replacing MATE panel and menus with dzen2 and rofi.
</p>
</div>
</div>
</div>

<div id="outline-container-orga958f6c" class="outline-2">
<h2 id="2021-02-09-Web">Web</h2>
<div class="outline-text-2" id="text-2021-02-09-Web">
</div>


<div id="outline-container-org7a1d490" class="outline-3">
<h3 id="2021-02-09-Firefox">Firefox</h3>
<div class="outline-text-3" id="text-2021-02-09-Firefox">
<p>
Firefox is the least worse web browser despite how Mozilla tries so
hard to kill off its user base.  Not much to say except how I battle
some of its worse behavior:
</p>
</div>

<div id="outline-container-orgfa29ca2" class="outline-4">
<h4 id="orgfa29ca2">Load URL via remote without grabbing attention</h4>
<div class="outline-text-4" id="text-orgfa29ca2">
<p>
Set <code>browser.tabs.loadDivertedInBackground</code> to <code>true</code> in
<code>about:config</code>.  Otherwise sending a URL via remote open will have
Firefox grab focus, possibly switching to it on a different virtual
desktop.  This is super annoying when doing important things like
loading the morning's web comics from <code>liferea</code>.
</p>
</div>
</div>

<div id="outline-container-org1c0b1ab" class="outline-4">
<h4 id="org1c0b1ab">Emacs-like keybindings in firefox</h4>
<div class="outline-text-4" id="text-org1c0b1ab">
<p>
This is one of the most frustrating things and most of the things
found online are wrong.  What to do depends on the desktop environment
<b>and</b> its version <b>and</b> maybe the distribution.
</p>

<p>
Debian <code>buster</code> and MATE 1.20.
</p>

<pre class="example">
gsettings set org.mate.interface gtk-key-theme 'Emacs'
</pre>

<p>
Or, 
</p>


<pre class="example">
~/.config/gtk-3.0/settings.ini:

# Get firefox to use emacs keybindings
[Settings]
gtk-key-theme-name = Emacs
</pre>

<p>
For <a href="https://developer.mozilla.org/en-US/docs/Tools/Settings#Editor_Preferences">editor</a> <code>about:config</code> and
</p>

<div class="org-center">
<p>
devtools.editor.keymap emacs
</p>
</div>
</div>
</div>


<div id="outline-container-org28de096" class="outline-4">
<h4 id="org28de096">Using Emacs to edit text</h4>
<div class="outline-text-4" id="text-org28de096">
<p>
There used to be <a href="../itsalltext/index.html">ItsAllText</a>.  Now there is <a href="https://addons.mozilla.org/en-US/firefox/addon/edit-with-emacs1/">Edit with Emacs</a> and
<a href="https://addons.mozilla.org/en-US/firefox/addon/ghosttext/">GhostText</a>.  The former I could not make work and the latter seems
fine.
</p>

<p>
GhostText needs <code>atomic-chrome</code> to be running on Emacs.  It's
available from the Emacs package sites.  In <a href="#org4bf9b51">Emacs servers</a> I describe
how the Emacs server for atomic-chrome to talk to get started.  The
main Emacs parts in <code>init-atomic-chrome.el</code> are:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #b4fa70;">setq</span> server-name <span style="color: #e9b96e;">"atomic-chrome"</span>)
(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">markdown-mode</span>
  <span style="color: #e090d7;">:ensure</span> t
  <span style="color: #e090d7;">:config</span>
  (<span style="color: #b4fa70;">setq</span> markdown-command <span style="color: #e9b96e;">"/usr/bin/markdown"</span>))
(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">markdown-preview-mode</span>
  <span style="color: #e090d7;">:ensure</span> t)
(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">atomic-chrome</span>
  <span style="color: #e090d7;">:ensure</span> t
  <span style="color: #e090d7;">:config</span>
  (<span style="color: #b4fa70;">setq</span> atomic-chrome-default-major-mode 'markdown-mode)
  (<span style="color: #b4fa70;">setq</span> atomic-chrome-url-major-mode-alist
        '((<span style="color: #e9b96e;">"github\\.com"</span> . gfm-mode)
          (<span style="color: #e9b96e;">"reddit\\.com"</span> . markdown-mode)
          (<span style="color: #e9b96e;">"redmine"</span> . textile-mode)))
  (<span style="color: #b4fa70;">setq</span> atomic-chrome-buffer-open-style 'frame)
)
(atomic-chrome-start-server)
</pre>
</div>

<p>
To use, I click the GhostText icon, sometimes it prompts me for which
text area to edit, then an Emacs frame pops us.  As I type in Emacs
the text entry updates.
</p>
</div>

<div id="outline-container-org66574e4" class="outline-5">
<h5 id="org66574e4"><span class="todo TODO">TODO</span> get nice rendered preview for GitHub and Reddit text entries</h5>
</div>
</div>

<div id="outline-container-orgfdfa56e" class="outline-4">
<h4 id="orgfdfa56e">Bookmark capture</h4>
<div class="outline-text-4" id="text-orgfdfa56e">
<p>
The <code>emacs-capture</code> and Emacs server "capture" is described above.  On the Firefox end I need a bookmarklet:
</p>

<pre class="example">
javascript:location.href='org-protocol://capture://w/'+encodeURIComponent(location.href)+'/'+encodeURIComponent(document.title)+'/'+encodeURIComponent(window.getSelection())
</pre>

<p>
The <code>/w/</code> corresponds to an org capture template
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #b4fa70;">setq</span> org-capture-templates
      (<span style="color: #b4fa70;">quote</span>
       ((<span style="color: #e9b96e;">"w"</span> <span style="color: #e9b96e;">"Web Bookmark"</span> entry
         (file+headline <span style="color: #e9b96e;">"~/org/webcapture.org"</span> <span style="color: #e9b96e;">"Bookmarks"</span>)
         <span style="color: #e9b96e;">"* %a :website:%^G\n:PROPERTIES:\n:CREATED: %U\n:END:\n%i\n %?"</span>
         <span style="color: #e090d7;">:empty-lines</span> 1 <span style="color: #e090d7;">:immediate-finish</span> nil)))
      org-agenda-files (list <span style="color: #e9b96e;">"~/org/webcapture.org"</span>))
</pre>
</div>

<p>
Some frame management is done with:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #b4fa70;">defadvice</span> <span style="color: #fce94f;">org-capture</span>
    (after make-full-window-frame activate)
  <span style="color: #e9b96e;">"Advise capture to be the only window when used as a popup"</span>
 (<span style="color: #b4fa70;">if</span> (equal <span style="color: #e9b96e;">"emacs-capture"</span> (frame-parameter nil 'name))
     (delete-other-windows)))

(<span style="color: #b4fa70;">defadvice</span> <span style="color: #fce94f;">org-capture-finalize</span>
    (after delete-capture-frame activate)
  <span style="color: #e9b96e;">"Advise capture-finalize to close the frame"</span>
  (<span style="color: #b4fa70;">if</span> (equal <span style="color: #e9b96e;">"emacs-capture"</span> (frame-parameter nil 'name))
      (delete-frame)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4855e62" class="outline-4">
<h4 id="org4855e62">Kill Sticky</h4>
<div class="outline-text-4" id="text-org4855e62">
<p>
The web is mostly festering garbage and getting worse over time.  Many web sites, even ones that should know batter (stack overflow) put up so much obscuring crap that it can be hard to see the content.  Enter <b>Kill Sticky</b> (not a Tarantino movie, but better).  It is <a href="https://alisdair.mcdiarmid.org/kill-sticky-headers/">this bookmarklet</a>:
</p>

<pre class="example">
javascript:(function()%7B(function%20()%20%7Bvar%20i%2C%20elements%20%3D%20document.querySelectorAll('body%20*')%3Bfor%20(i%20%3D%200%3B%20i%20%3C%20elements.length%3B%20i%2B%2B)%20%7Bif%20(getComputedStyle(elements%5Bi%5D).position%20%3D%3D%3D%20'fixed')%20%7Belements%5Bi%5D.parentNode.removeChild(elements%5Bi%5D)%3B%7D%7D%7D)()%7D)()
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org68e5278" class="outline-2">
<h2 id="2021-02-09-Source">Source</h2>
<div class="outline-text-2" id="text-2021-02-09-Source">
<p>
See also <a href="#2021-02-09-Configuration">Configuration</a> and individual package sections.  Here I describe ways I install software locally which means outside of Debian's package management.
</p>
</div>
