howido.org
** DIY opt
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-DIY-opt
   :END:

For some development dependencies, I will build and install using ~$HOME/opt/<pkg>~ as the install "prefix".  I try to avoid making these part of day-to-day environment.

** Stow
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Stow
   :END:

I used to follow the [[DIY opt]] method to provide software that is built from source until I had a weird time traveling revelation.  I'm essentially the only user on most machines where I need what was in [[DIY opt]] so why not just install to ~/usr/local~.  The one thing that was lacking was pristine uninstallation.  To get that I started using the venerable GNU Stow package.

Even though implemented in Perl, GNU Stow works great (joke)!  One-time setup

#+begin_example
  # mkdir /usr/local/stow
  # chgrp staff /usr/local/stow
  # chmod g+s /usr/local/stow
  # sudo adduser bv staff
#+end_example

I then install from source to a location under the Stow directory with a name based on the package name and version.  Eg

#+begin_example
  $ ./configure --prefix=/usr/local/stow/rofi-1.6.1/
  $ make -j (nproc)
  $ make install
#+end_example

Then finish with

#+begin_example
  # cd /usr/local/stow
  # stow rofi-1.6.1
#+end_example

** CMake
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-CMake
   :END:

#+begin_example
  $ mkdir ~/opt
  $ cd pkg
  $ mkdir build && cd build
  $ cmake -G Ninja .. -DCMAKE_INSTALL_PREFIX=$HOME/opt/pkg [...]
  $ cmake --build . -- -j$(nproc)
  $ cmake --build . --target install
#+end_example

** autoconf
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-autoconf
   :END:

#+begin_example
  $ mkdir ~/opt
  $ cd pkg
  $ ./autogen
  $ ./configure --prefix=$HOME/opt/pkg
  $ make -j$(nproc)
  $ make install
#+end_example


** Spack
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Spack
   :END:


** Nix
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Nix
   :END:

** Python
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Python
   :END:

When I work on a Python package I use ~direnv~ (see also [[Shells]]) do:

#+begin_example
  # apt install direnv
  $ cd a-python-package/
  $ echo layout python3 > .envrc
  $ direnv allow
  $ pip install -e .
#+end_example

A lesser way but which does not require ~direnv~

#+begin_example
  $ python3 -m venv venv
  $ source venv/bin/activate
  $ pip install -e .
#+end_example


* Photos
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Photo-management
  :END:

See also [[Syncthing]] for how photos are extracted off my phone.  

** Rephile
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Rephile
   :END:

I used to dump photos from scans, cameras or phones into various directories.  This grew organic and I've lost chunks of memories when directories went missing.  So I got "serious" and wrote [[https://brettviren.github.io/rephile][rephile]].  It still allows a distributed store sprinkled around various directories and it supports [[Git annex][git-annex]] repositories.  It keeps an ~sqlite~ database of metadata and has some extras such as uploads to a popular image host.


* Sync
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Sync
  :END:


** Syncthing
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Syncthing
   :END:

Syncthing is a jewel of a system.  It's your own personal peer-to-peer (which here means you-to-you or you-to-friends not you-to-anonymous-strangers) file transfer system.  Encryption, distribute hash table, UDP hole punching, simple beautiful web interface, cross platform.  What more can you ask for?

I run it on my android phone and all Linux machines, home and at work.
For the phone I sync photos and org files.  For Linux machines various
things but in particular a =~/sync/= is shared between all and holds
mostly my talks.  My =~/org/= holds my personal "wiki" where I hold
proto-documents, notes, etc as well as bookmarks grabbed as described
above.

One caution: the optional use of relay for data is safe and can be useful to get around tricky routing problems (both ends behind very strict firewalls) but take note that some hosts that provide Syncthing relay are also TOR nodes.  Despite these being wholly separate data streams, some idiot "security" mechanisms will flag your Syncthing as a TOR node because it happens to connect to an Internet host which also happens to provide a TOR service.

** Git annex
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Git-annex
   :END:

tbd. git + big files + sync rules + metadata.  Used for photos and other.  


* Passwords

** Pass

I use [[https://git.zx2c4.com/password-store/about/][pass]].  I almost never share the same password for different endpoints and almost always use high character random passwords which I never bother to remember.



* Time
  :PROPERTIES:
  :CUSTOM_ID: 2021-02-09-Time
  :END:

** arbtt
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-arbtt
   :END:

At work we have to "track" our time even though we don't get payed hourly.  It feels to me a very annoying and demeaning thing.  I "protest" by keeping hugely, massively, stupidly pedantic track of my time.  I know, it's nonsensical and weird but it allows me to comply without raising my blood pressure.  Fight idiocy with lunacy, I always say.

I do this by running [[https://arbtt.nomeata.de/#what][arbtt]] on my work computers.    It starts with cron

#+begin_example
$ crontab -l |grep arbtt
@reboot /home/bv/scripts/start-arbtt-capture
#+end_example

When my employer nags me to enter this very crucial data I run a script

#+begin_example
  $ time-sheet
  ...
  heather,Sat,2020-05-02,0.87,1.45
  heather,Sun,2020-05-03,1.68,1.68
  heather,Mon,2020-05-04,2.24,6.77
  heather,Tue,2020-05-05,2.80,7.89
  heather,Wed,2020-05-06,2.99,5.79
  heather,Thu,2020-05-07,8.47,9.47
  heather,Fri,2020-05-08,3.49,9.16
  heather,Sun,2020-05-10,2.30,3.24
#+end_example

Second to last column shows total hours my session was active, last column is time diff between last action and first in the day (MTW I was on "vacation" so less than nominal eight).  


** Time zones
   :PROPERTIES:
   :CUSTOM_ID: 2021-02-09-Meetings
   :END:

I have a [[https://superuser.com/a/1397116][hacked scrip]] to help me with timezones

#+begin_example
  $ time-to-meet tomorrow
  February 10, 2021
  Here          08  09  10  11  12  13  14  15  16  17  18  19  20 
  UTC           13  14  15  16  17  18  19  20  21  22  23  24  25 (+5)
  Los_Angeles   05  06  07  08  09  10  11  12  13  14  15  16  17 (-3)
  Chicago       07  08  09  10  11  12  13  14  15  16  17  18  19 (-1)
  London        13  14  15  16  17  18  19  20  21  22  23  24  25 (+5)
  Zurich        14  15  16  17  18  19  20  21  22  23  24  25  26 (+6)
  Japan         22  23  24  25  26  27  28  29  30  31  32  33  34 (+14)
#+end_example

** Meetings

Most people around me use "doodle" which is kind of a pain. [[https://www.when2meet.com/][when2meet]] is far superior.

