howido.html

<div id="outline-container-org75b19ee" class="outline-3">
<h3 id="2021-02-09-DIY-opt">DIY opt</h3>
<div class="outline-text-3" id="text-2021-02-09-DIY-opt">
<p>
For some development dependencies, I will build and install using <code>$HOME/opt/&lt;pkg&gt;</code> as the install "prefix".  I try to avoid making these part of day-to-day environment.
</p>
</div>
</div>

<div id="outline-container-org5c9be60" class="outline-3">
<h3 id="2021-02-09-Stow">Stow</h3>
<div class="outline-text-3" id="text-2021-02-09-Stow">
<p>
I used to follow the <a href="#2021-02-09-DIY-opt">DIY opt</a> method to provide software that is built from source until I had a weird time traveling revelation.  I'm essentially the only user on most machines where I need what was in <a href="#2021-02-09-DIY-opt">DIY opt</a> so why not just install to <code>/usr/local</code>.  The one thing that was lacking was pristine uninstallation.  To get that I started using the venerable GNU Stow package.
</p>

<p>
Even though implemented in Perl, GNU Stow works great (joke)!  One-time setup
</p>

<pre class="example">
# mkdir /usr/local/stow
# chgrp staff /usr/local/stow
# chmod g+s /usr/local/stow
# sudo adduser bv staff
</pre>

<p>
I then install from source to a location under the Stow directory with a name based on the package name and version.  Eg
</p>

<pre class="example">
$ ./configure --prefix=/usr/local/stow/rofi-1.6.1/
$ make -j (nproc)
$ make install
</pre>

<p>
Then finish with
</p>

<pre class="example">
# cd /usr/local/stow
# stow rofi-1.6.1
</pre>
</div>
</div>

<div id="outline-container-org1b375dc" class="outline-3">
<h3 id="2021-02-09-CMake">CMake</h3>
<div class="outline-text-3" id="text-2021-02-09-CMake">
<pre class="example">
$ mkdir ~/opt
$ cd pkg
$ mkdir build &amp;&amp; cd build
$ cmake -G Ninja .. -DCMAKE_INSTALL_PREFIX=$HOME/opt/pkg [...]
$ cmake --build . -- -j$(nproc)
$ cmake --build . --target install
</pre>
</div>
</div>

<div id="outline-container-org616e8fb" class="outline-3">
<h3 id="2021-02-09-autoconf">autoconf</h3>
<div class="outline-text-3" id="text-2021-02-09-autoconf">
<pre class="example">
$ mkdir ~/opt
$ cd pkg
$ ./autogen
$ ./configure --prefix=$HOME/opt/pkg
$ make -j$(nproc)
$ make install
</pre>
</div>
</div>


<div id="outline-container-orgbe59eff" class="outline-3">
<h3 id="2021-02-09-Spack">Spack</h3>
<div class="outline-text-3" id="text-2021-02-09-Spack">
</div>
</div>


<div id="outline-container-org7b88cfc" class="outline-3">
<h3 id="2021-02-09-Nix">Nix</h3>
<div class="outline-text-3" id="text-2021-02-09-Nix">
</div>
</div>

<div id="outline-container-orgfc1d652" class="outline-3">
<h3 id="2021-02-09-Python">Python</h3>
<div class="outline-text-3" id="text-2021-02-09-Python">
<p>
When I work on a Python package I use <code>direnv</code> (see also <a href="#2021-02-09-Command-shell">Shells</a>) do:
</p>

<pre class="example">
# apt install direnv
$ cd a-python-package/
$ echo layout python3 &gt; .envrc
$ direnv allow
$ pip install -e .
</pre>

<p>
A lesser way but which does not require <code>direnv</code>
</p>

<pre class="example">
$ python3 -m venv venv
$ source venv/bin/activate
$ pip install -e .
</pre>
</div>
</div>
</div>


<div id="outline-container-org8db4846" class="outline-2">
<h2 id="2021-02-09-Photo-management">Photos</h2>
<div class="outline-text-2" id="text-2021-02-09-Photo-management">
<p>
See also <a href="#2021-02-09-Syncthing">Syncthing</a> for how photos are extracted off my phone.  
</p>
</div>

<div id="outline-container-org93eea7a" class="outline-3">
<h3 id="2021-02-09-Rephile">Rephile</h3>
<div class="outline-text-3" id="text-2021-02-09-Rephile">
<p>
I used to dump photos from scans, cameras or phones into various directories.  This grew organic and I've lost chunks of memories when directories went missing.  So I got "serious" and wrote <a href="https://brettviren.github.io/rephile">rephile</a>.  It still allows a distributed store sprinkled around various directories and it supports <a href="#2021-02-09-Git-annex">git-annex</a> repositories.  It keeps an <code>sqlite</code> database of metadata and has some extras such as uploads to a popular image host.
</p>
</div>
</div>
</div>


<div id="outline-container-org9c7f390" class="outline-2">
<h2 id="2021-02-09-Sync">Sync</h2>
<div class="outline-text-2" id="text-2021-02-09-Sync">
</div>


<div id="outline-container-org0a0e34f" class="outline-3">
<h3 id="2021-02-09-Syncthing">Syncthing</h3>
<div class="outline-text-3" id="text-2021-02-09-Syncthing">
<p>
Syncthing is a jewel of a system.  It's your own personal peer-to-peer (which here means you-to-you or you-to-friends not you-to-anonymous-strangers) file transfer system.  Encryption, distribute hash table, UDP hole punching, simple beautiful web interface, cross platform.  What more can you ask for?
</p>

<p>
I run it on my android phone and all Linux machines, home and at work.
For the phone I sync photos and org files.  For Linux machines various
things but in particular a <code>~/sync/</code> is shared between all and holds
mostly my talks.  My <code>~/org/</code> holds my personal "wiki" where I hold
proto-documents, notes, etc as well as bookmarks grabbed as described
above.
</p>

<p>
One caution: the optional use of relay for data is safe and can be useful to get around tricky routing problems (both ends behind very strict firewalls) but take note that some hosts that provide Syncthing relay are also TOR nodes.  Despite these being wholly separate data streams, some idiot "security" mechanisms will flag your Syncthing as a TOR node because it happens to connect to an Internet host which also happens to provide a TOR service.
</p>
</div>
</div>

<div id="outline-container-orgae6d5fa" class="outline-3">
<h3 id="2021-02-09-Git-annex">Git annex</h3>
<div class="outline-text-3" id="text-2021-02-09-Git-annex">
<p>
tbd. git + big files + sync rules + metadata.  Used for photos and other.  
</p>
</div>
</div>
</div>


<div id="outline-container-orge6d2070" class="outline-2">
<h2 id="orge6d2070">Passwords</h2>
<div class="outline-text-2" id="text-orge6d2070">
</div>
<div id="outline-container-org3434fa7" class="outline-3">
<h3 id="org3434fa7">Pass</h3>
<div class="outline-text-3" id="text-org3434fa7">
<p>
I use <a href="https://git.zx2c4.com/password-store/about/">pass</a>.  I almost never share the same password for different endpoints and almost always use high character random passwords which I never bother to remember.
</p>
</div>
</div>
</div>



<div id="outline-container-org6192cd4" class="outline-2">
<h2 id="2021-02-09-Time">Time</h2>
<div class="outline-text-2" id="text-2021-02-09-Time">
</div>

<div id="outline-container-orgeb7ed2f" class="outline-3">
<h3 id="2021-02-09-arbtt">arbtt</h3>
<div class="outline-text-3" id="text-2021-02-09-arbtt">
<p>
At work we have to "track" our time even though we don't get payed hourly.  It feels to me a very annoying and demeaning thing.  I "protest" by keeping hugely, massively, stupidly pedantic track of my time.  I know, it's nonsensical and weird but it allows me to comply without raising my blood pressure.  Fight idiocy with lunacy, I always say.
</p>

<p>
I do this by running <a href="https://arbtt.nomeata.de/#what">arbtt</a> on my work computers.    It starts with cron
</p>

<pre class="example">
$ crontab -l |grep arbtt
@reboot /home/bv/scripts/start-arbtt-capture
</pre>

<p>
When my employer nags me to enter this very crucial data I run a script
</p>

<pre class="example">
$ time-sheet
...
heather,Sat,2020-05-02,0.87,1.45
heather,Sun,2020-05-03,1.68,1.68
heather,Mon,2020-05-04,2.24,6.77
heather,Tue,2020-05-05,2.80,7.89
heather,Wed,2020-05-06,2.99,5.79
heather,Thu,2020-05-07,8.47,9.47
heather,Fri,2020-05-08,3.49,9.16
heather,Sun,2020-05-10,2.30,3.24
</pre>

<p>
Second to last column shows total hours my session was active, last column is time diff between last action and first in the day (MTW I was on "vacation" so less than nominal eight).  
</p>
</div>
</div>


<div id="outline-container-org2f9f3c6" class="outline-3">
<h3 id="2021-02-09-Meetings">Time zones</h3>
<div class="outline-text-3" id="text-2021-02-09-Meetings">
<p>
I have a <a href="https://superuser.com/a/1397116">hacked scrip</a> to help me with timezones
</p>

<pre class="example">
$ time-to-meet tomorrow
February 10, 2021
Here          08  09  10  11  12  13  14  15  16  17  18  19  20 
UTC           13  14  15  16  17  18  19  20  21  22  23  24  25 (+5)
Los_Angeles   05  06  07  08  09  10  11  12  13  14  15  16  17 (-3)
Chicago       07  08  09  10  11  12  13  14  15  16  17  18  19 (-1)
London        13  14  15  16  17  18  19  20  21  22  23  24  25 (+5)
Zurich        14  15  16  17  18  19  20  21  22  23  24  25  26 (+6)
Japan         22  23  24  25  26  27  28  29  30  31  32  33  34 (+14)
</pre>
</div>
</div>

<div id="outline-container-org5db678c" class="outline-3">
<h3 id="org5db678c">Meetings</h3>
<div class="outline-text-3" id="text-org5db678c">
<p>
Most people around me use "doodle" which is kind of a pain. <a href="https://www.when2meet.com/">when2meet</a> is far superior.
</p>
</div>
</div>
</div>
